Re_6M/0deg_5nrg_SF/constant/turbulenceThermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationThermalType RASThermal;

RASThermal
{
    RASThermalModel        nrgAHFM;

    turbulenceThermal      on;

    printCoeffs     on;
    
    nrgAHFMCoeffs
    {
        RePr  4320000;
    }
}

// ************************************************************************* //
